remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/efuse_misc_regs.h
/**
 * \file
 *
 * \brief Component description for EFUSE_MISC_REGS
 *
 * Copyright (c) 2015-2018 Microchip Technology Inc. and its subsidiaries.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Subject to your compliance with these terms, you may use Microchip
 * software and any derivatives exclusively with Microchip products.
 * It is your responsibility to comply with third party license terms applicable
 * to your use of third party software (including open source software) that
 * may accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES,
 * WHETHER EXPRESS, IMPLIED OR STATUTORY, APPLY TO THIS SOFTWARE,
 * INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY,
 * AND FITNESS FOR A PARTICULAR PURPOSE. IN NO EVENT WILL MICROCHIP BE
 * LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE
 * SOFTWARE, HOWEVER CAUSED, EVEN IF MICROCHIP HAS BEEN ADVISED OF THE
 * POSSIBILITY OR THE DAMAGES ARE FORESEEABLE.  TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY
 * RELATED TO THIS SOFTWARE WILL NOT EXCEED THE AMOUNT OF FEES, IF ANY,
 * THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 * \asf_license_stop
 *
 */

#ifndef _SAMB11_EFUSE_MISC_REGS_COMPONENT_
#define _SAMB11_EFUSE_MISC_REGS_COMPONENT_

/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR EFUSE_MISC_REGS */
/* ========================================================================== */
/** \addtogroup SAMB11_EFUSE_MISC_REGS EFUSE Misc Registers 
 *  @{
 */

#ifndef COMPONENT_TYPEDEF_STYLE
  #define COMPONENT_TYPEDEF_STYLE 'N'  /**< Defines default style of typedefs for the component header files ('R' = RFO, 'N' = NTO*/
#endif

#define EFUSE_MISC_REGS_EMR1234
#define REV_EFUSE_MISC_REGS              0x100

/* -------- EFUSE_MISC_REGS_EFUSE_GLOBAL_RESET : (EFUSE_MISC_REGS Offset: 0x00) (R/W 8) Active Low Global Reset -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  GLOBAL_RSTN:1;             /**< bit:      0  Global Reset                             */
    uint8_t  EFUSE_1_RSTN:1;            /**< bit:      1  EFUSE 1 Reset                            */
    uint8_t  EFUSE_2_RSTN:1;            /**< bit:      2  EFUSE 2 Reset                            */
    uint8_t  EFUSE_3_RSTN:1;            /**< bit:      3  EFUSE 3 Reset                            */
    uint8_t  EFUSE_4_RSTN:1;            /**< bit:      4  EFUSE 4 Reset                            */
    uint8_t  EFUSE_5_RSTN:1;            /**< bit:      5  EFUSE 5 Reset                            */
    uint8_t  EFUSE_6_RSTN:1;            /**< bit:      6  EFUSE 6 Reset                            */
    uint8_t  :1;                        /**< bit:      7  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} EFUSE_MISC_REGS_EFUSE_GLOBAL_RESET_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define EFUSE_MISC_REGS_EFUSE_GLOBAL_RESET_OFFSET 0x00                                          /**<  (EFUSE_MISC_REGS_EFUSE_GLOBAL_RESET) Active Low Global Reset  Offset */
#define EFUSE_MISC_REGS_EFUSE_GLOBAL_RESET_RESETVALUE 0x7Fu                                         /**<  (EFUSE_MISC_REGS_EFUSE_GLOBAL_RESET) Active Low Global Reset  Reset Value */

#define EFUSE_MISC_REGS_EFUSE_GLOBAL_RESET_GLOBAL_RSTN_Pos 0                                              /**< (EFUSE_MISC_REGS_EFUSE_GLOBAL_RESET) Global Reset Position */
#define EFUSE_MISC_REGS_EFUSE_GLOBAL_RESET_GLOBAL_RSTN_Msk (0x1u << EFUSE_MISC_REGS_EFUSE_GLOBAL_RESET_GLOBAL_RSTN_Pos)  /**< (EFUSE_MISC_REGS_EFUSE_GLOBAL_RESET) Global Reset Mask */
#define EFUSE_MISC_REGS_EFUSE_GLOBAL_RESET_GLOBAL_RSTN EFUSE_MISC_REGS_EFUSE_GLOBAL_RESET_GLOBAL_RSTN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use EFUSE_MISC_REGS_EFUSE_GLOBAL_RESET_GLOBAL_RSTN_Msk instead */
#define EFUSE_MISC_REGS_EFUSE_GLOBAL_RESET_EFUSE_1_RSTN_Pos 1                                              /**< (EFUSE_MISC_REGS_EFUSE_GLOBAL_RESET) EFUSE 1 Reset Position */
#define EFUSE_MISC_REGS_EFUSE_GLOBAL_RESET_EFUSE_1_RSTN_Msk (0x1u << EFUSE_MISC_REGS_EFUSE_GLOBAL_RESET_EFUSE_1_RSTN_Pos)  /**< (EFUSE_MISC_REGS_EFUSE_GLOBAL_RESET) EFUSE 1 Reset Mask */
#define EFUSE_MISC_REGS_EFUSE_GLOBAL_RESET_EFUSE_1_RSTN EFUSE_MISC_REGS_EFUSE_GLOBAL_RESET_EFUSE_1_RSTN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use EFUSE_MISC_REGS_EFUSE_GLOBAL_RESET_EFUSE_1_RSTN_Msk instead */
#define EFUSE_MISC_REGS_EFUSE_GLOBAL_RESET_EFUSE_2_RSTN_Pos 2                                              /**< (EFUSE_MISC_REGS_EFUSE_GLOBAL_RESET) EFUSE 2 Reset Position */
#define EFUSE_MISC_REGS_EFUSE_GLOBAL_RESET_EFUSE_2_RSTN_Msk (0x1u << EFUSE_MISC_REGS_EFUSE_GLOBAL_RESET_EFUSE_2_RSTN_Pos)  /**< (EFUSE_MISC_REGS_EFUSE_GLOBAL_RESET) EFUSE 2 Reset Mask */
#define EFUSE_MISC_REGS_EFUSE_GLOBAL_RESET_EFUSE_2_RSTN EFUSE_MISC_REGS_EFUSE_GLOBAL_RESET_EFUSE_2_RSTN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use EFUSE_MISC_REGS_EFUSE_GLOBAL_RESET_EFUSE_2_RSTN_Msk instead */
#define EFUSE_MISC_REGS_EFUSE_GLOBAL_RESET_EFUSE_3_RSTN_Pos 3                                              /**< (EFUSE_MISC_REGS_EFUSE_GLOBAL_RESET) EFUSE 3 Reset Position */
#define EFUSE_MISC_REGS_EFUSE_GLOBAL_RESET_EFUSE_3_RSTN_Msk (0x1u << EFUSE_MISC_REGS_EFUSE_GLOBAL_RESET_EFUSE_3_RSTN_Pos)  /**< (EFUSE_MISC_REGS_EFUSE_GLOBAL_RESET) EFUSE 3 Reset Mask */
#define EFUSE_MISC_REGS_EFUSE_GLOBAL_RESET_EFUSE_3_RSTN EFUSE_MISC_REGS_EFUSE_GLOBAL_RESET_EFUSE_3_RSTN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use EFUSE_MISC_REGS_EFUSE_GLOBAL_RESET_EFUSE_3_RSTN_Msk instead */
#define EFUSE_MISC_REGS_EFUSE_GLOBAL_RESET_EFUSE_4_RSTN_Pos 4                                              /**< (EFUSE_MISC_REGS_EFUSE_GLOBAL_RESET) EFUSE 4 Reset Position */
#define EFUSE_MISC_REGS_EFUSE_GLOBAL_RESET_EFUSE_4_RSTN_Msk (0x1u << EFUSE_MISC_REGS_EFUSE_GLOBAL_RESET_EFUSE_4_RSTN_Pos)  /**< (EFUSE_MISC_REGS_EFUSE_GLOBAL_RESET) EFUSE 4 Reset Mask */
#define EFUSE_MISC_REGS_EFUSE_GLOBAL_RESET_EFUSE_4_RSTN EFUSE_MISC_REGS_EFUSE_GLOBAL_RESET_EFUSE_4_RSTN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use EFUSE_MISC_REGS_EFUSE_GLOBAL_RESET_EFUSE_4_RSTN_Msk instead */
#define EFUSE_MISC_REGS_EFUSE_GLOBAL_RESET_EFUSE_5_RSTN_Pos 5                                              /**< (EFUSE_MISC_REGS_EFUSE_GLOBAL_RESET) EFUSE 5 Reset Position */
#define EFUSE_MISC_REGS_EFUSE_GLOBAL_RESET_EFUSE_5_RSTN_Msk (0x1u << EFUSE_MISC_REGS_EFUSE_GLOBAL_RESET_EFUSE_5_RSTN_Pos)  /**< (EFUSE_MISC_REGS_EFUSE_GLOBAL_RESET) EFUSE 5 Reset Mask */
#define EFUSE_MISC_REGS_EFUSE_GLOBAL_RESET_EFUSE_5_RSTN EFUSE_MISC_REGS_EFUSE_GLOBAL_RESET_EFUSE_5_RSTN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use EFUSE_MISC_REGS_EFUSE_GLOBAL_RESET_EFUSE_5_RSTN_Msk instead */
#define EFUSE_MISC_REGS_EFUSE_GLOBAL_RESET_EFUSE_6_RSTN_Pos 6                                              /**< (EFUSE_MISC_REGS_EFUSE_GLOBAL_RESET) EFUSE 6 Reset Position */
#define EFUSE_MISC_REGS_EFUSE_GLOBAL_RESET_EFUSE_6_RSTN_Msk (0x1u << EFUSE_MISC_REGS_EFUSE_GLOBAL_RESET_EFUSE_6_RSTN_Pos)  /**< (EFUSE_MISC_REGS_EFUSE_GLOBAL_RESET) EFUSE 6 Reset Mask */
#define EFUSE_MISC_REGS_EFUSE_GLOBAL_RESET_EFUSE_6_RSTN EFUSE_MISC_REGS_EFUSE_GLOBAL_RESET_EFUSE_6_RSTN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use EFUSE_MISC_REGS_EFUSE_GLOBAL_RESET_EFUSE_6_RSTN_Msk instead */
#define EFUSE_MISC_REGS_EFUSE_GLOBAL_RESET_MASK 0x7Fu                                          /**< \deprecated (EFUSE_MISC_REGS_EFUSE_GLOBAL_RESET) Register MASK  (Use EFUSE_MISC_REGS_EFUSE_GLOBAL_RESET_Msk instead)  */
#define EFUSE_MISC_REGS_EFUSE_GLOBAL_RESET_Msk 0x7Fu                                          /**< (EFUSE_MISC_REGS_EFUSE_GLOBAL_RESET) Register Mask  */

/* -------- EFUSE_MISC_REGS_EFUSE_1_CONTROL : (EFUSE_MISC_REGS Offset: 0x04) (R/W 32) EFUSE 1 Control Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t FORCE_LOAD:1;              /**< bit:      0  Efuse Control Force Load                 */
    uint32_t START_PROGRAM:1;           /**< bit:      1  When set to 1 will start programming EFUSE */
    uint32_t FIRST_READ_COUNT:9;        /**< bit:  2..10  First Read Count                         */
    uint32_t FIRST_PROG_COUNT:4;        /**< bit: 11..14  First Program Count                      */
    uint32_t PROG_CLK_H_COUNT:9;        /**< bit: 15..23  First Clock High Count                   */
    uint32_t DEBUG_BUS_SEL:3;           /**< bit: 24..26  EFUSE Debug Bus Selection                */
    uint32_t :4;                        /**< bit: 27..30  Reserved */
    uint32_t EFUSE_LOAD_DONE:1;         /**< bit:     31  Efuse Load Done Indication               */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} EFUSE_MISC_REGS_EFUSE_1_CONTROL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define EFUSE_MISC_REGS_EFUSE_1_CONTROL_OFFSET 0x04                                          /**<  (EFUSE_MISC_REGS_EFUSE_1_CONTROL) EFUSE 1 Control Register  Offset */
#define EFUSE_MISC_REGS_EFUSE_1_CONTROL_RESETVALUE 0x3FCu                                        /**<  (EFUSE_MISC_REGS_EFUSE_1_CONTROL) EFUSE 1 Control Register  Reset Value */

