remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/efuse_misc_regs.h
#define EFUSE_MISC_REGS_EFUSE_2_CONTROL_FORCE_LOAD_Pos 0                                              /**< (EFUSE_MISC_REGS_EFUSE_2_CONTROL) Efuse Control Force Load Position */
#define EFUSE_MISC_REGS_EFUSE_2_CONTROL_FORCE_LOAD_Msk (0x1u << EFUSE_MISC_REGS_EFUSE_2_CONTROL_FORCE_LOAD_Pos)  /**< (EFUSE_MISC_REGS_EFUSE_2_CONTROL) Efuse Control Force Load Mask */
#define EFUSE_MISC_REGS_EFUSE_2_CONTROL_FORCE_LOAD EFUSE_MISC_REGS_EFUSE_2_CONTROL_FORCE_LOAD_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use EFUSE_MISC_REGS_EFUSE_2_CONTROL_FORCE_LOAD_Msk instead */
#define EFUSE_MISC_REGS_EFUSE_2_CONTROL_START_PROGRAM_Pos 1                                              /**< (EFUSE_MISC_REGS_EFUSE_2_CONTROL) When set to 1 will start programming EFUSE Position */
#define EFUSE_MISC_REGS_EFUSE_2_CONTROL_START_PROGRAM_Msk (0x1u << EFUSE_MISC_REGS_EFUSE_2_CONTROL_START_PROGRAM_Pos)  /**< (EFUSE_MISC_REGS_EFUSE_2_CONTROL) When set to 1 will start programming EFUSE Mask */
#define EFUSE_MISC_REGS_EFUSE_2_CONTROL_START_PROGRAM EFUSE_MISC_REGS_EFUSE_2_CONTROL_START_PROGRAM_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use EFUSE_MISC_REGS_EFUSE_2_CONTROL_START_PROGRAM_Msk instead */
#define EFUSE_MISC_REGS_EFUSE_2_CONTROL_FIRST_READ_COUNT_Pos 2                                              /**< (EFUSE_MISC_REGS_EFUSE_2_CONTROL) First Read Count Position */
#define EFUSE_MISC_REGS_EFUSE_2_CONTROL_FIRST_READ_COUNT_Msk (0x1FFu << EFUSE_MISC_REGS_EFUSE_2_CONTROL_FIRST_READ_COUNT_Pos)  /**< (EFUSE_MISC_REGS_EFUSE_2_CONTROL) First Read Count Mask */
#define EFUSE_MISC_REGS_EFUSE_2_CONTROL_FIRST_READ_COUNT(value) (EFUSE_MISC_REGS_EFUSE_2_CONTROL_FIRST_READ_COUNT_Msk & ((value) << EFUSE_MISC_REGS_EFUSE_2_CONTROL_FIRST_READ_COUNT_Pos))
#define EFUSE_MISC_REGS_EFUSE_2_CONTROL_FIRST_PROG_COUNT_Pos 11                                             /**< (EFUSE_MISC_REGS_EFUSE_2_CONTROL) First Program Count Position */
#define EFUSE_MISC_REGS_EFUSE_2_CONTROL_FIRST_PROG_COUNT_Msk (0xFu << EFUSE_MISC_REGS_EFUSE_2_CONTROL_FIRST_PROG_COUNT_Pos)  /**< (EFUSE_MISC_REGS_EFUSE_2_CONTROL) First Program Count Mask */
#define EFUSE_MISC_REGS_EFUSE_2_CONTROL_FIRST_PROG_COUNT(value) (EFUSE_MISC_REGS_EFUSE_2_CONTROL_FIRST_PROG_COUNT_Msk & ((value) << EFUSE_MISC_REGS_EFUSE_2_CONTROL_FIRST_PROG_COUNT_Pos))
#define EFUSE_MISC_REGS_EFUSE_2_CONTROL_PROG_CLK_H_COUNT_Pos 15                                             /**< (EFUSE_MISC_REGS_EFUSE_2_CONTROL) First Clock High Count Position */
#define EFUSE_MISC_REGS_EFUSE_2_CONTROL_PROG_CLK_H_COUNT_Msk (0x1FFu << EFUSE_MISC_REGS_EFUSE_2_CONTROL_PROG_CLK_H_COUNT_Pos)  /**< (EFUSE_MISC_REGS_EFUSE_2_CONTROL) First Clock High Count Mask */
#define EFUSE_MISC_REGS_EFUSE_2_CONTROL_PROG_CLK_H_COUNT(value) (EFUSE_MISC_REGS_EFUSE_2_CONTROL_PROG_CLK_H_COUNT_Msk & ((value) << EFUSE_MISC_REGS_EFUSE_2_CONTROL_PROG_CLK_H_COUNT_Pos))
#define EFUSE_MISC_REGS_EFUSE_2_CONTROL_DEBUG_BUS_SEL_Pos 24                                             /**< (EFUSE_MISC_REGS_EFUSE_2_CONTROL) EFUSE Debug Bus Selection Position */
#define EFUSE_MISC_REGS_EFUSE_2_CONTROL_DEBUG_BUS_SEL_Msk (0x7u << EFUSE_MISC_REGS_EFUSE_2_CONTROL_DEBUG_BUS_SEL_Pos)  /**< (EFUSE_MISC_REGS_EFUSE_2_CONTROL) EFUSE Debug Bus Selection Mask */
#define EFUSE_MISC_REGS_EFUSE_2_CONTROL_DEBUG_BUS_SEL(value) (EFUSE_MISC_REGS_EFUSE_2_CONTROL_DEBUG_BUS_SEL_Msk & ((value) << EFUSE_MISC_REGS_EFUSE_2_CONTROL_DEBUG_BUS_SEL_Pos))
#define EFUSE_MISC_REGS_EFUSE_2_CONTROL_EFUSE_LOAD_DONE_Pos 31                                             /**< (EFUSE_MISC_REGS_EFUSE_2_CONTROL) Efuse Load Done Indication Position */
#define EFUSE_MISC_REGS_EFUSE_2_CONTROL_EFUSE_LOAD_DONE_Msk (0x1u << EFUSE_MISC_REGS_EFUSE_2_CONTROL_EFUSE_LOAD_DONE_Pos)  /**< (EFUSE_MISC_REGS_EFUSE_2_CONTROL) Efuse Load Done Indication Mask */
#define EFUSE_MISC_REGS_EFUSE_2_CONTROL_EFUSE_LOAD_DONE EFUSE_MISC_REGS_EFUSE_2_CONTROL_EFUSE_LOAD_DONE_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use EFUSE_MISC_REGS_EFUSE_2_CONTROL_EFUSE_LOAD_DONE_Msk instead */
#define EFUSE_MISC_REGS_EFUSE_2_CONTROL_MASK 0x87FFFFFFu                                    /**< \deprecated (EFUSE_MISC_REGS_EFUSE_2_CONTROL) Register MASK  (Use EFUSE_MISC_REGS_EFUSE_2_CONTROL_Msk instead)  */
#define EFUSE_MISC_REGS_EFUSE_2_CONTROL_Msk 0x87FFFFFFu                                    /**< (EFUSE_MISC_REGS_EFUSE_2_CONTROL) Register Mask  */

/* -------- EFUSE_MISC_REGS_EFUSE_3_CONTROL : (EFUSE_MISC_REGS Offset: 0x0c) (R/W 32) EFUSE 3 Control Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t FORCE_LOAD:1;              /**< bit:      0  Efuse Control Force Load                 */
    uint32_t START_PROGRAM:1;           /**< bit:      1  When set to 1 will start programming EFUSE */
    uint32_t FIRST_READ_COUNT:9;        /**< bit:  2..10  First Read Count                         */
    uint32_t FIRST_PROG_COUNT:4;        /**< bit: 11..14  First Program Count                      */
    uint32_t PROG_CLK_H_COUNT:9;        /**< bit: 15..23  First Clock High Count                   */
    uint32_t DEBUG_BUS_SEL:3;           /**< bit: 24..26  EFUSE Debug Bus Selection                */
    uint32_t :4;                        /**< bit: 27..30  Reserved */
    uint32_t EFUSE_LOAD_DONE:1;         /**< bit:     31  Efuse Load Done Indication               */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} EFUSE_MISC_REGS_EFUSE_3_CONTROL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define EFUSE_MISC_REGS_EFUSE_3_CONTROL_OFFSET 0x0C                                          /**<  (EFUSE_MISC_REGS_EFUSE_3_CONTROL) EFUSE 3 Control Register  Offset */
#define EFUSE_MISC_REGS_EFUSE_3_CONTROL_RESETVALUE 0x3FCu                                        /**<  (EFUSE_MISC_REGS_EFUSE_3_CONTROL) EFUSE 3 Control Register  Reset Value */

#define EFUSE_MISC_REGS_EFUSE_3_CONTROL_FORCE_LOAD_Pos 0                                              /**< (EFUSE_MISC_REGS_EFUSE_3_CONTROL) Efuse Control Force Load Position */
#define EFUSE_MISC_REGS_EFUSE_3_CONTROL_FORCE_LOAD_Msk (0x1u << EFUSE_MISC_REGS_EFUSE_3_CONTROL_FORCE_LOAD_Pos)  /**< (EFUSE_MISC_REGS_EFUSE_3_CONTROL) Efuse Control Force Load Mask */
#define EFUSE_MISC_REGS_EFUSE_3_CONTROL_FORCE_LOAD EFUSE_MISC_REGS_EFUSE_3_CONTROL_FORCE_LOAD_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use EFUSE_MISC_REGS_EFUSE_3_CONTROL_FORCE_LOAD_Msk instead */
#define EFUSE_MISC_REGS_EFUSE_3_CONTROL_START_PROGRAM_Pos 1                                              /**< (EFUSE_MISC_REGS_EFUSE_3_CONTROL) When set to 1 will start programming EFUSE Position */
#define EFUSE_MISC_REGS_EFUSE_3_CONTROL_START_PROGRAM_Msk (0x1u << EFUSE_MISC_REGS_EFUSE_3_CONTROL_START_PROGRAM_Pos)  /**< (EFUSE_MISC_REGS_EFUSE_3_CONTROL) When set to 1 will start programming EFUSE Mask */
#define EFUSE_MISC_REGS_EFUSE_3_CONTROL_START_PROGRAM EFUSE_MISC_REGS_EFUSE_3_CONTROL_START_PROGRAM_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use EFUSE_MISC_REGS_EFUSE_3_CONTROL_START_PROGRAM_Msk instead */
#define EFUSE_MISC_REGS_EFUSE_3_CONTROL_FIRST_READ_COUNT_Pos 2                                              /**< (EFUSE_MISC_REGS_EFUSE_3_CONTROL) First Read Count Position */
#define EFUSE_MISC_REGS_EFUSE_3_CONTROL_FIRST_READ_COUNT_Msk (0x1FFu << EFUSE_MISC_REGS_EFUSE_3_CONTROL_FIRST_READ_COUNT_Pos)  /**< (EFUSE_MISC_REGS_EFUSE_3_CONTROL) First Read Count Mask */
#define EFUSE_MISC_REGS_EFUSE_3_CONTROL_FIRST_READ_COUNT(value) (EFUSE_MISC_REGS_EFUSE_3_CONTROL_FIRST_READ_COUNT_Msk & ((value) << EFUSE_MISC_REGS_EFUSE_3_CONTROL_FIRST_READ_COUNT_Pos))
#define EFUSE_MISC_REGS_EFUSE_3_CONTROL_FIRST_PROG_COUNT_Pos 11                                             /**< (EFUSE_MISC_REGS_EFUSE_3_CONTROL) First Program Count Position */
#define EFUSE_MISC_REGS_EFUSE_3_CONTROL_FIRST_PROG_COUNT_Msk (0xFu << EFUSE_MISC_REGS_EFUSE_3_CONTROL_FIRST_PROG_COUNT_Pos)  /**< (EFUSE_MISC_REGS_EFUSE_3_CONTROL) First Program Count Mask */
#define EFUSE_MISC_REGS_EFUSE_3_CONTROL_FIRST_PROG_COUNT(value) (EFUSE_MISC_REGS_EFUSE_3_CONTROL_FIRST_PROG_COUNT_Msk & ((value) << EFUSE_MISC_REGS_EFUSE_3_CONTROL_FIRST_PROG_COUNT_Pos))
#define EFUSE_MISC_REGS_EFUSE_3_CONTROL_PROG_CLK_H_COUNT_Pos 15                                             /**< (EFUSE_MISC_REGS_EFUSE_3_CONTROL) First Clock High Count Position */
#define EFUSE_MISC_REGS_EFUSE_3_CONTROL_PROG_CLK_H_COUNT_Msk (0x1FFu << EFUSE_MISC_REGS_EFUSE_3_CONTROL_PROG_CLK_H_COUNT_Pos)  /**< (EFUSE_MISC_REGS_EFUSE_3_CONTROL) First Clock High Count Mask */
#define EFUSE_MISC_REGS_EFUSE_3_CONTROL_PROG_CLK_H_COUNT(value) (EFUSE_MISC_REGS_EFUSE_3_CONTROL_PROG_CLK_H_COUNT_Msk & ((value) << EFUSE_MISC_REGS_EFUSE_3_CONTROL_PROG_CLK_H_COUNT_Pos))
#define EFUSE_MISC_REGS_EFUSE_3_CONTROL_DEBUG_BUS_SEL_Pos 24                                             /**< (EFUSE_MISC_REGS_EFUSE_3_CONTROL) EFUSE Debug Bus Selection Position */
#define EFUSE_MISC_REGS_EFUSE_3_CONTROL_DEBUG_BUS_SEL_Msk (0x7u << EFUSE_MISC_REGS_EFUSE_3_CONTROL_DEBUG_BUS_SEL_Pos)  /**< (EFUSE_MISC_REGS_EFUSE_3_CONTROL) EFUSE Debug Bus Selection Mask */
#define EFUSE_MISC_REGS_EFUSE_3_CONTROL_DEBUG_BUS_SEL(value) (EFUSE_MISC_REGS_EFUSE_3_CONTROL_DEBUG_BUS_SEL_Msk & ((value) << EFUSE_MISC_REGS_EFUSE_3_CONTROL_DEBUG_BUS_SEL_Pos))
#define EFUSE_MISC_REGS_EFUSE_3_CONTROL_EFUSE_LOAD_DONE_Pos 31                                             /**< (EFUSE_MISC_REGS_EFUSE_3_CONTROL) Efuse Load Done Indication Position */
#define EFUSE_MISC_REGS_EFUSE_3_CONTROL_EFUSE_LOAD_DONE_Msk (0x1u << EFUSE_MISC_REGS_EFUSE_3_CONTROL_EFUSE_LOAD_DONE_Pos)  /**< (EFUSE_MISC_REGS_EFUSE_3_CONTROL) Efuse Load Done Indication Mask */
#define EFUSE_MISC_REGS_EFUSE_3_CONTROL_EFUSE_LOAD_DONE EFUSE_MISC_REGS_EFUSE_3_CONTROL_EFUSE_LOAD_DONE_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use EFUSE_MISC_REGS_EFUSE_3_CONTROL_EFUSE_LOAD_DONE_Msk instead */
#define EFUSE_MISC_REGS_EFUSE_3_CONTROL_MASK 0x87FFFFFFu                                    /**< \deprecated (EFUSE_MISC_REGS_EFUSE_3_CONTROL) Register MASK  (Use EFUSE_MISC_REGS_EFUSE_3_CONTROL_Msk instead)  */
#define EFUSE_MISC_REGS_EFUSE_3_CONTROL_Msk 0x87FFFFFFu                                    /**< (EFUSE_MISC_REGS_EFUSE_3_CONTROL) Register Mask  */

/* -------- EFUSE_MISC_REGS_EFUSE_4_CONTROL : (EFUSE_MISC_REGS Offset: 0x10) (R/W 32) EFUSE 4 Control Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t FORCE_LOAD:1;              /**< bit:      0  Efuse Control Force Load                 */
    uint32_t START_PROGRAM:1;           /**< bit:      1  When set to 1 will start programming EFUSE */
    uint32_t FIRST_READ_COUNT:9;        /**< bit:  2..10  First Read Count                         */
    uint32_t FIRST_PROG_COUNT:4;        /**< bit: 11..14  First Program Count                      */
    uint32_t PROG_CLK_H_COUNT:9;        /**< bit: 15..23  First Clock High Count                   */
    uint32_t DEBUG_BUS_SEL:3;           /**< bit: 24..26  EFUSE Debug Bus Selection                */
    uint32_t :4;                        /**< bit: 27..30  Reserved */
    uint32_t EFUSE_LOAD_DONE:1;         /**< bit:     31  Efuse Load Done Indication               */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} EFUSE_MISC_REGS_EFUSE_4_CONTROL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define EFUSE_MISC_REGS_EFUSE_4_CONTROL_OFFSET 0x10                                          /**<  (EFUSE_MISC_REGS_EFUSE_4_CONTROL) EFUSE 4 Control Register  Offset */
#define EFUSE_MISC_REGS_EFUSE_4_CONTROL_RESETVALUE 0x3FCu                                        /**<  (EFUSE_MISC_REGS_EFUSE_4_CONTROL) EFUSE 4 Control Register  Reset Value */

