remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/efuse_misc_regs.h
#define EFUSE_MISC_REGS_EFUSE_2_STATUS_0_OFFSET 0x4C                                          /**<  (EFUSE_MISC_REGS_EFUSE_2_STATUS_0) EFUSE_2_0 Status  Offset */
#define EFUSE_MISC_REGS_EFUSE_2_STATUS_0_RESETVALUE 0x00u                                         /**<  (EFUSE_MISC_REGS_EFUSE_2_STATUS_0) EFUSE_2_0 Status  Reset Value */

#define EFUSE_MISC_REGS_EFUSE_2_STATUS_0_EFUSE_2_STATUS_0_Pos 0                                              /**< (EFUSE_MISC_REGS_EFUSE_2_STATUS_0)  Position */
#define EFUSE_MISC_REGS_EFUSE_2_STATUS_0_EFUSE_2_STATUS_0_Msk (0xFFFFFFFFu << EFUSE_MISC_REGS_EFUSE_2_STATUS_0_EFUSE_2_STATUS_0_Pos)  /**< (EFUSE_MISC_REGS_EFUSE_2_STATUS_0)  Mask */
#define EFUSE_MISC_REGS_EFUSE_2_STATUS_0_EFUSE_2_STATUS_0(value) (EFUSE_MISC_REGS_EFUSE_2_STATUS_0_EFUSE_2_STATUS_0_Msk & ((value) << EFUSE_MISC_REGS_EFUSE_2_STATUS_0_EFUSE_2_STATUS_0_Pos))
#define EFUSE_MISC_REGS_EFUSE_2_STATUS_0_MASK 0xFFFFFFFFu                                    /**< \deprecated (EFUSE_MISC_REGS_EFUSE_2_STATUS_0) Register MASK  (Use EFUSE_MISC_REGS_EFUSE_2_STATUS_0_Msk instead)  */
#define EFUSE_MISC_REGS_EFUSE_2_STATUS_0_Msk 0xFFFFFFFFu                                    /**< (EFUSE_MISC_REGS_EFUSE_2_STATUS_0) Register Mask  */

/* -------- EFUSE_MISC_REGS_EFUSE_2_STATUS_1 : (EFUSE_MISC_REGS Offset: 0x50) (R/ 32) EFUSE_2_1 Status -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t EFUSE_2_STATUS_1:32;       /**< bit:  0..31                                           */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} EFUSE_MISC_REGS_EFUSE_2_STATUS_1_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define EFUSE_MISC_REGS_EFUSE_2_STATUS_1_OFFSET 0x50                                          /**<  (EFUSE_MISC_REGS_EFUSE_2_STATUS_1) EFUSE_2_1 Status  Offset */
#define EFUSE_MISC_REGS_EFUSE_2_STATUS_1_RESETVALUE 0x00u                                         /**<  (EFUSE_MISC_REGS_EFUSE_2_STATUS_1) EFUSE_2_1 Status  Reset Value */

#define EFUSE_MISC_REGS_EFUSE_2_STATUS_1_EFUSE_2_STATUS_1_Pos 0                                              /**< (EFUSE_MISC_REGS_EFUSE_2_STATUS_1)  Position */
#define EFUSE_MISC_REGS_EFUSE_2_STATUS_1_EFUSE_2_STATUS_1_Msk (0xFFFFFFFFu << EFUSE_MISC_REGS_EFUSE_2_STATUS_1_EFUSE_2_STATUS_1_Pos)  /**< (EFUSE_MISC_REGS_EFUSE_2_STATUS_1)  Mask */
#define EFUSE_MISC_REGS_EFUSE_2_STATUS_1_EFUSE_2_STATUS_1(value) (EFUSE_MISC_REGS_EFUSE_2_STATUS_1_EFUSE_2_STATUS_1_Msk & ((value) << EFUSE_MISC_REGS_EFUSE_2_STATUS_1_EFUSE_2_STATUS_1_Pos))
#define EFUSE_MISC_REGS_EFUSE_2_STATUS_1_MASK 0xFFFFFFFFu                                    /**< \deprecated (EFUSE_MISC_REGS_EFUSE_2_STATUS_1) Register MASK  (Use EFUSE_MISC_REGS_EFUSE_2_STATUS_1_Msk instead)  */
#define EFUSE_MISC_REGS_EFUSE_2_STATUS_1_Msk 0xFFFFFFFFu                                    /**< (EFUSE_MISC_REGS_EFUSE_2_STATUS_1) Register Mask  */

/* -------- EFUSE_MISC_REGS_EFUSE_2_STATUS_2 : (EFUSE_MISC_REGS Offset: 0x54) (R/ 32) EFUSE_2_2 Status -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t EFUSE_2_STATUS_2:32;       /**< bit:  0..31                                           */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} EFUSE_MISC_REGS_EFUSE_2_STATUS_2_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define EFUSE_MISC_REGS_EFUSE_2_STATUS_2_OFFSET 0x54                                          /**<  (EFUSE_MISC_REGS_EFUSE_2_STATUS_2) EFUSE_2_2 Status  Offset */
#define EFUSE_MISC_REGS_EFUSE_2_STATUS_2_RESETVALUE 0x00u                                         /**<  (EFUSE_MISC_REGS_EFUSE_2_STATUS_2) EFUSE_2_2 Status  Reset Value */

#define EFUSE_MISC_REGS_EFUSE_2_STATUS_2_EFUSE_2_STATUS_2_Pos 0                                              /**< (EFUSE_MISC_REGS_EFUSE_2_STATUS_2)  Position */
#define EFUSE_MISC_REGS_EFUSE_2_STATUS_2_EFUSE_2_STATUS_2_Msk (0xFFFFFFFFu << EFUSE_MISC_REGS_EFUSE_2_STATUS_2_EFUSE_2_STATUS_2_Pos)  /**< (EFUSE_MISC_REGS_EFUSE_2_STATUS_2)  Mask */
#define EFUSE_MISC_REGS_EFUSE_2_STATUS_2_EFUSE_2_STATUS_2(value) (EFUSE_MISC_REGS_EFUSE_2_STATUS_2_EFUSE_2_STATUS_2_Msk & ((value) << EFUSE_MISC_REGS_EFUSE_2_STATUS_2_EFUSE_2_STATUS_2_Pos))
#define EFUSE_MISC_REGS_EFUSE_2_STATUS_2_MASK 0xFFFFFFFFu                                    /**< \deprecated (EFUSE_MISC_REGS_EFUSE_2_STATUS_2) Register MASK  (Use EFUSE_MISC_REGS_EFUSE_2_STATUS_2_Msk instead)  */
#define EFUSE_MISC_REGS_EFUSE_2_STATUS_2_Msk 0xFFFFFFFFu                                    /**< (EFUSE_MISC_REGS_EFUSE_2_STATUS_2) Register Mask  */

/* -------- EFUSE_MISC_REGS_EFUSE_2_STATUS_3 : (EFUSE_MISC_REGS Offset: 0x58) (R/ 32) EFUSE_2_3 Status -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t EFUSE_2_STATUS_3:32;       /**< bit:  0..31                                           */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} EFUSE_MISC_REGS_EFUSE_2_STATUS_3_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define EFUSE_MISC_REGS_EFUSE_2_STATUS_3_OFFSET 0x58                                          /**<  (EFUSE_MISC_REGS_EFUSE_2_STATUS_3) EFUSE_2_3 Status  Offset */
#define EFUSE_MISC_REGS_EFUSE_2_STATUS_3_RESETVALUE 0x00u                                         /**<  (EFUSE_MISC_REGS_EFUSE_2_STATUS_3) EFUSE_2_3 Status  Reset Value */

#define EFUSE_MISC_REGS_EFUSE_2_STATUS_3_EFUSE_2_STATUS_3_Pos 0                                              /**< (EFUSE_MISC_REGS_EFUSE_2_STATUS_3)  Position */
#define EFUSE_MISC_REGS_EFUSE_2_STATUS_3_EFUSE_2_STATUS_3_Msk (0xFFFFFFFFu << EFUSE_MISC_REGS_EFUSE_2_STATUS_3_EFUSE_2_STATUS_3_Pos)  /**< (EFUSE_MISC_REGS_EFUSE_2_STATUS_3)  Mask */
#define EFUSE_MISC_REGS_EFUSE_2_STATUS_3_EFUSE_2_STATUS_3(value) (EFUSE_MISC_REGS_EFUSE_2_STATUS_3_EFUSE_2_STATUS_3_Msk & ((value) << EFUSE_MISC_REGS_EFUSE_2_STATUS_3_EFUSE_2_STATUS_3_Pos))
#define EFUSE_MISC_REGS_EFUSE_2_STATUS_3_MASK 0xFFFFFFFFu                                    /**< \deprecated (EFUSE_MISC_REGS_EFUSE_2_STATUS_3) Register MASK  (Use EFUSE_MISC_REGS_EFUSE_2_STATUS_3_Msk instead)  */
#define EFUSE_MISC_REGS_EFUSE_2_STATUS_3_Msk 0xFFFFFFFFu                                    /**< (EFUSE_MISC_REGS_EFUSE_2_STATUS_3) Register Mask  */

/* -------- EFUSE_MISC_REGS_EFUSE_3_PROG_0 : (EFUSE_MISC_REGS Offset: 0x5c) (R/W 32) EFUSE_3_0 Program Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t EFUSE_3_PROG_0:32;         /**< bit:  0..31                                           */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} EFUSE_MISC_REGS_EFUSE_3_PROG_0_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define EFUSE_MISC_REGS_EFUSE_3_PROG_0_OFFSET 0x5C                                          /**<  (EFUSE_MISC_REGS_EFUSE_3_PROG_0) EFUSE_3_0 Program Register  Offset */
#define EFUSE_MISC_REGS_EFUSE_3_PROG_0_RESETVALUE 0x00u                                         /**<  (EFUSE_MISC_REGS_EFUSE_3_PROG_0) EFUSE_3_0 Program Register  Reset Value */

