remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/efuse_misc_regs.h
#define EFUSE_MISC_REGS_EFUSE_6_STATUS_3_OFFSET 0xD8                                          /**<  (EFUSE_MISC_REGS_EFUSE_6_STATUS_3) EFUSE_6_3 Status  Offset */
#define EFUSE_MISC_REGS_EFUSE_6_STATUS_3_RESETVALUE 0x00u                                         /**<  (EFUSE_MISC_REGS_EFUSE_6_STATUS_3) EFUSE_6_3 Status  Reset Value */

#define EFUSE_MISC_REGS_EFUSE_6_STATUS_3_EFUSE_6_STATUS_3_Pos 0                                              /**< (EFUSE_MISC_REGS_EFUSE_6_STATUS_3)  Position */
#define EFUSE_MISC_REGS_EFUSE_6_STATUS_3_EFUSE_6_STATUS_3_Msk (0xFFFFFFFFu << EFUSE_MISC_REGS_EFUSE_6_STATUS_3_EFUSE_6_STATUS_3_Pos)  /**< (EFUSE_MISC_REGS_EFUSE_6_STATUS_3)  Mask */
#define EFUSE_MISC_REGS_EFUSE_6_STATUS_3_EFUSE_6_STATUS_3(value) (EFUSE_MISC_REGS_EFUSE_6_STATUS_3_EFUSE_6_STATUS_3_Msk & ((value) << EFUSE_MISC_REGS_EFUSE_6_STATUS_3_EFUSE_6_STATUS_3_Pos))
#define EFUSE_MISC_REGS_EFUSE_6_STATUS_3_MASK 0xFFFFFFFFu                                    /**< \deprecated (EFUSE_MISC_REGS_EFUSE_6_STATUS_3) Register MASK  (Use EFUSE_MISC_REGS_EFUSE_6_STATUS_3_Msk instead)  */
#define EFUSE_MISC_REGS_EFUSE_6_STATUS_3_Msk 0xFFFFFFFFu                                    /**< (EFUSE_MISC_REGS_EFUSE_6_STATUS_3) Register Mask  */

/* -------- EFUSE_MISC_REGS_EFUSE_MISC_CTRL : (EFUSE_MISC_REGS Offset: 0xdc) (R/ 8) EFUSE 6 Control Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  OUT_OF_RESET:1;            /**< bit:      0  Read back the status of the eFuse out of reset */
    uint8_t  :7;                        /**< bit:   1..7  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} EFUSE_MISC_REGS_EFUSE_MISC_CTRL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define EFUSE_MISC_REGS_EFUSE_MISC_CTRL_OFFSET 0xDC                                          /**<  (EFUSE_MISC_REGS_EFUSE_MISC_CTRL) EFUSE 6 Control Register  Offset */
#define EFUSE_MISC_REGS_EFUSE_MISC_CTRL_RESETVALUE 0x00u                                         /**<  (EFUSE_MISC_REGS_EFUSE_MISC_CTRL) EFUSE 6 Control Register  Reset Value */

#define EFUSE_MISC_REGS_EFUSE_MISC_CTRL_OUT_OF_RESET_Pos 0                                              /**< (EFUSE_MISC_REGS_EFUSE_MISC_CTRL) Read back the status of the eFuse out of reset Position */
#define EFUSE_MISC_REGS_EFUSE_MISC_CTRL_OUT_OF_RESET_Msk (0x1u << EFUSE_MISC_REGS_EFUSE_MISC_CTRL_OUT_OF_RESET_Pos)  /**< (EFUSE_MISC_REGS_EFUSE_MISC_CTRL) Read back the status of the eFuse out of reset Mask */
#define EFUSE_MISC_REGS_EFUSE_MISC_CTRL_OUT_OF_RESET EFUSE_MISC_REGS_EFUSE_MISC_CTRL_OUT_OF_RESET_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use EFUSE_MISC_REGS_EFUSE_MISC_CTRL_OUT_OF_RESET_Msk instead */
#define EFUSE_MISC_REGS_EFUSE_MISC_CTRL_MASK 0x01u                                          /**< \deprecated (EFUSE_MISC_REGS_EFUSE_MISC_CTRL) Register MASK  (Use EFUSE_MISC_REGS_EFUSE_MISC_CTRL_Msk instead)  */
#define EFUSE_MISC_REGS_EFUSE_MISC_CTRL_Msk 0x01u                                          /**< (EFUSE_MISC_REGS_EFUSE_MISC_CTRL) Register Mask  */

#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'R'
/** \brief EFUSE_MISC_REGS hardware registers */
typedef struct {  /* EFUSE Misc Registers */
  RwReg8  EFUSE_GLOBAL_RESET; /**< (EFUSE_MISC_REGS Offset: 0x00) Active Low Global Reset */
  __I  uint8_t  Reserved1[3];
  RwReg   EFUSE_1_CONTROL; /**< (EFUSE_MISC_REGS Offset: 0x04) EFUSE 1 Control Register */
  RwReg   EFUSE_2_CONTROL; /**< (EFUSE_MISC_REGS Offset: 0x08) EFUSE 2 Control Register */
  RwReg   EFUSE_3_CONTROL; /**< (EFUSE_MISC_REGS Offset: 0x0C) EFUSE 3 Control Register */
  RwReg   EFUSE_4_CONTROL; /**< (EFUSE_MISC_REGS Offset: 0x10) EFUSE 4 Control Register */
  RwReg   EFUSE_5_CONTROL; /**< (EFUSE_MISC_REGS Offset: 0x14) EFUSE 5 Control Register */
  RwReg   EFUSE_6_CONTROL; /**< (EFUSE_MISC_REGS Offset: 0x18) EFUSE 6 Control Register */
  RwReg   EFUSE_1_PROG_0; /**< (EFUSE_MISC_REGS Offset: 0x1C) EFUSE_1_0 Program Register */
  RwReg   EFUSE_1_PROG_1; /**< (EFUSE_MISC_REGS Offset: 0x20) EFUSE_1_1 Program Register */
  RwReg   EFUSE_1_PROG_2; /**< (EFUSE_MISC_REGS Offset: 0x24) EFUSE_1_2 Program Register */
  RwReg   EFUSE_1_PROG_3; /**< (EFUSE_MISC_REGS Offset: 0x28) EFUSE_1_3 Program Register */
  RoReg   EFUSE_1_STATUS_0; /**< (EFUSE_MISC_REGS Offset: 0x2C) EFUSE_1_0 Status */
  RoReg   EFUSE_1_STATUS_1; /**< (EFUSE_MISC_REGS Offset: 0x30) EFUSE_1_1 Status */
  RoReg   EFUSE_1_STATUS_2; /**< (EFUSE_MISC_REGS Offset: 0x34) EFUSE_1_2 Status */
  RoReg   EFUSE_1_STATUS_3; /**< (EFUSE_MISC_REGS Offset: 0x38) EFUSE_1_3 Status */
  RwReg   EFUSE_2_PROG_0; /**< (EFUSE_MISC_REGS Offset: 0x3C) EFUSE_2_0 Program Register */
  RwReg   EFUSE_2_PROG_1; /**< (EFUSE_MISC_REGS Offset: 0x40) EFUSE_2_1 Program Register */
  RwReg   EFUSE_2_PROG_2; /**< (EFUSE_MISC_REGS Offset: 0x44) EFUSE_2_2 Program Register */
  RwReg   EFUSE_2_PROG_3; /**< (EFUSE_MISC_REGS Offset: 0x48) EFUSE_2_3 Program Register */
  RoReg   EFUSE_2_STATUS_0; /**< (EFUSE_MISC_REGS Offset: 0x4C) EFUSE_2_0 Status */
  RoReg   EFUSE_2_STATUS_1; /**< (EFUSE_MISC_REGS Offset: 0x50) EFUSE_2_1 Status */
  RoReg   EFUSE_2_STATUS_2; /**< (EFUSE_MISC_REGS Offset: 0x54) EFUSE_2_2 Status */
  RoReg   EFUSE_2_STATUS_3; /**< (EFUSE_MISC_REGS Offset: 0x58) EFUSE_2_3 Status */
  RwReg   EFUSE_3_PROG_0; /**< (EFUSE_MISC_REGS Offset: 0x5C) EFUSE_3_0 Program Register */
  RwReg   EFUSE_3_PROG_1; /**< (EFUSE_MISC_REGS Offset: 0x60) EFUSE_3_1 Program Register */
  RwReg   EFUSE_3_PROG_2; /**< (EFUSE_MISC_REGS Offset: 0x64) EFUSE_3_2 Program Register */
  RwReg   EFUSE_3_PROG_3; /**< (EFUSE_MISC_REGS Offset: 0x68) EFUSE_3_3 Program Register */
  RoReg   EFUSE_3_STATUS_0; /**< (EFUSE_MISC_REGS Offset: 0x6C) EFUSE_3_0 Status */
  RoReg   EFUSE_3_STATUS_1; /**< (EFUSE_MISC_REGS Offset: 0x70) EFUSE_3_1 Status */
  RoReg   EFUSE_3_STATUS_2; /**< (EFUSE_MISC_REGS Offset: 0x74) EFUSE_3_2 Status */
  RoReg   EFUSE_3_STATUS_3; /**< (EFUSE_MISC_REGS Offset: 0x78) EFUSE_3_3 Status */
  RwReg   EFUSE_4_PROG_0; /**< (EFUSE_MISC_REGS Offset: 0x7C) EFUSE_4_0 Program Register */
  RwReg   EFUSE_4_PROG_1; /**< (EFUSE_MISC_REGS Offset: 0x80) EFUSE_4_1 Program Register */
  RwReg   EFUSE_4_PROG_2; /**< (EFUSE_MISC_REGS Offset: 0x84) EFUSE_4_2 Program Register */
  RwReg   EFUSE_4_PROG_3; /**< (EFUSE_MISC_REGS Offset: 0x88) EFUSE_4_3 Program Register */
  RoReg   EFUSE_4_STATUS_0; /**< (EFUSE_MISC_REGS Offset: 0x8C) EFUSE_4_0 Status */
  RoReg   EFUSE_4_STATUS_1; /**< (EFUSE_MISC_REGS Offset: 0x90) EFUSE_4_1 Status */
  RoReg   EFUSE_4_STATUS_2; /**< (EFUSE_MISC_REGS Offset: 0x94) EFUSE_4_2 Status */
  RoReg   EFUSE_4_STATUS_3; /**< (EFUSE_MISC_REGS Offset: 0x98) EFUSE_4_3 Status */
  RwReg   EFUSE_5_PROG_0; /**< (EFUSE_MISC_REGS Offset: 0x9C) EFUSE_4_0 Program Register */
  RwReg   EFUSE_5_PROG_1; /**< (EFUSE_MISC_REGS Offset: 0xA0) EFUSE_5_1 Program Register */
  RwReg   EFUSE_5_PROG_2; /**< (EFUSE_MISC_REGS Offset: 0xA4) EFUSE_5_2 Program Register */
  RwReg   EFUSE_5_PROG_3; /**< (EFUSE_MISC_REGS Offset: 0xA8) EFUSE_5_3 Program Register */
  RoReg   EFUSE_5_STATUS_0; /**< (EFUSE_MISC_REGS Offset: 0xAC) EFUSE_5_0 Status */
  RoReg   EFUSE_5_STATUS_1; /**< (EFUSE_MISC_REGS Offset: 0xB0) EFUSE_5_1 Status */
  RoReg   EFUSE_5_STATUS_2; /**< (EFUSE_MISC_REGS Offset: 0xB4) EFUSE_5_2 Status */
  RoReg   EFUSE_5_STATUS_3; /**< (EFUSE_MISC_REGS Offset: 0xB8) EFUSE_5_3 Status */
  RwReg   EFUSE_6_PROG_0; /**< (EFUSE_MISC_REGS Offset: 0xBC) EFUSE_6_0 Program Register */
  RwReg   EFUSE_6_PROG_1; /**< (EFUSE_MISC_REGS Offset: 0xC0) EFUSE_6_1 Program Register */
  RwReg   EFUSE_6_PROG_2; /**< (EFUSE_MISC_REGS Offset: 0xC4) EFUSE_6_2 Program Register */
  RwReg   EFUSE_6_PROG_3; /**< (EFUSE_MISC_REGS Offset: 0xC8) EFUSE_6_3 Program Register */
  RoReg   EFUSE_6_STATUS_0; /**< (EFUSE_MISC_REGS Offset: 0xCC) EFUSE_6_0 Status */
  RoReg   EFUSE_6_STATUS_1; /**< (EFUSE_MISC_REGS Offset: 0xD0) EFUSE_6_1 Status */
  RoReg   EFUSE_6_STATUS_2; /**< (EFUSE_MISC_REGS Offset: 0xD4) EFUSE_6_2 Status */
  RoReg   EFUSE_6_STATUS_3; /**< (EFUSE_MISC_REGS Offset: 0xD8) EFUSE_6_3 Status */
  RoReg8  EFUSE_MISC_CTRL; /**< (EFUSE_MISC_REGS Offset: 0xDC) EFUSE 6 Control Register */
} EfuseMiscRegs;

