remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/efuse_misc_regs.h
#elif COMPONENT_TYPEDEF_STYLE == 'N'
/** \brief EFUSE_MISC_REGS hardware registers */
typedef struct {  /* EFUSE Misc Registers */
  __IO EFUSE_MISC_REGS_EFUSE_GLOBAL_RESET_Type EFUSE_GLOBAL_RESET; /**< Offset: 0x00 (R/W   8) Active Low Global Reset */
       RoReg8                         Reserved1[0x3];
  __IO EFUSE_MISC_REGS_EFUSE_1_CONTROL_Type EFUSE_1_CONTROL; /**< Offset: 0x04 (R/W  32) EFUSE 1 Control Register */
  __IO EFUSE_MISC_REGS_EFUSE_2_CONTROL_Type EFUSE_2_CONTROL; /**< Offset: 0x08 (R/W  32) EFUSE 2 Control Register */
  __IO EFUSE_MISC_REGS_EFUSE_3_CONTROL_Type EFUSE_3_CONTROL; /**< Offset: 0x0C (R/W  32) EFUSE 3 Control Register */
  __IO EFUSE_MISC_REGS_EFUSE_4_CONTROL_Type EFUSE_4_CONTROL; /**< Offset: 0x10 (R/W  32) EFUSE 4 Control Register */
  __IO EFUSE_MISC_REGS_EFUSE_5_CONTROL_Type EFUSE_5_CONTROL; /**< Offset: 0x14 (R/W  32) EFUSE 5 Control Register */
  __IO EFUSE_MISC_REGS_EFUSE_6_CONTROL_Type EFUSE_6_CONTROL; /**< Offset: 0x18 (R/W  32) EFUSE 6 Control Register */
  __IO EFUSE_MISC_REGS_EFUSE_1_PROG_0_Type EFUSE_1_PROG_0; /**< Offset: 0x1C (R/W  32) EFUSE_1_0 Program Register */
  __IO EFUSE_MISC_REGS_EFUSE_1_PROG_1_Type EFUSE_1_PROG_1; /**< Offset: 0x20 (R/W  32) EFUSE_1_1 Program Register */
  __IO EFUSE_MISC_REGS_EFUSE_1_PROG_2_Type EFUSE_1_PROG_2; /**< Offset: 0x24 (R/W  32) EFUSE_1_2 Program Register */
  __IO EFUSE_MISC_REGS_EFUSE_1_PROG_3_Type EFUSE_1_PROG_3; /**< Offset: 0x28 (R/W  32) EFUSE_1_3 Program Register */
  __I  EFUSE_MISC_REGS_EFUSE_1_STATUS_0_Type EFUSE_1_STATUS_0; /**< Offset: 0x2C (R/   32) EFUSE_1_0 Status */
  __I  EFUSE_MISC_REGS_EFUSE_1_STATUS_1_Type EFUSE_1_STATUS_1; /**< Offset: 0x30 (R/   32) EFUSE_1_1 Status */
  __I  EFUSE_MISC_REGS_EFUSE_1_STATUS_2_Type EFUSE_1_STATUS_2; /**< Offset: 0x34 (R/   32) EFUSE_1_2 Status */
  __I  EFUSE_MISC_REGS_EFUSE_1_STATUS_3_Type EFUSE_1_STATUS_3; /**< Offset: 0x38 (R/   32) EFUSE_1_3 Status */
  __IO EFUSE_MISC_REGS_EFUSE_2_PROG_0_Type EFUSE_2_PROG_0; /**< Offset: 0x3C (R/W  32) EFUSE_2_0 Program Register */
  __IO EFUSE_MISC_REGS_EFUSE_2_PROG_1_Type EFUSE_2_PROG_1; /**< Offset: 0x40 (R/W  32) EFUSE_2_1 Program Register */
  __IO EFUSE_MISC_REGS_EFUSE_2_PROG_2_Type EFUSE_2_PROG_2; /**< Offset: 0x44 (R/W  32) EFUSE_2_2 Program Register */
  __IO EFUSE_MISC_REGS_EFUSE_2_PROG_3_Type EFUSE_2_PROG_3; /**< Offset: 0x48 (R/W  32) EFUSE_2_3 Program Register */
  __I  EFUSE_MISC_REGS_EFUSE_2_STATUS_0_Type EFUSE_2_STATUS_0; /**< Offset: 0x4C (R/   32) EFUSE_2_0 Status */
  __I  EFUSE_MISC_REGS_EFUSE_2_STATUS_1_Type EFUSE_2_STATUS_1; /**< Offset: 0x50 (R/   32) EFUSE_2_1 Status */
  __I  EFUSE_MISC_REGS_EFUSE_2_STATUS_2_Type EFUSE_2_STATUS_2; /**< Offset: 0x54 (R/   32) EFUSE_2_2 Status */
  __I  EFUSE_MISC_REGS_EFUSE_2_STATUS_3_Type EFUSE_2_STATUS_3; /**< Offset: 0x58 (R/   32) EFUSE_2_3 Status */
  __IO EFUSE_MISC_REGS_EFUSE_3_PROG_0_Type EFUSE_3_PROG_0; /**< Offset: 0x5C (R/W  32) EFUSE_3_0 Program Register */
  __IO EFUSE_MISC_REGS_EFUSE_3_PROG_1_Type EFUSE_3_PROG_1; /**< Offset: 0x60 (R/W  32) EFUSE_3_1 Program Register */
  __IO EFUSE_MISC_REGS_EFUSE_3_PROG_2_Type EFUSE_3_PROG_2; /**< Offset: 0x64 (R/W  32) EFUSE_3_2 Program Register */
  __IO EFUSE_MISC_REGS_EFUSE_3_PROG_3_Type EFUSE_3_PROG_3; /**< Offset: 0x68 (R/W  32) EFUSE_3_3 Program Register */
  __I  EFUSE_MISC_REGS_EFUSE_3_STATUS_0_Type EFUSE_3_STATUS_0; /**< Offset: 0x6C (R/   32) EFUSE_3_0 Status */
  __I  EFUSE_MISC_REGS_EFUSE_3_STATUS_1_Type EFUSE_3_STATUS_1; /**< Offset: 0x70 (R/   32) EFUSE_3_1 Status */
  __I  EFUSE_MISC_REGS_EFUSE_3_STATUS_2_Type EFUSE_3_STATUS_2; /**< Offset: 0x74 (R/   32) EFUSE_3_2 Status */
  __I  EFUSE_MISC_REGS_EFUSE_3_STATUS_3_Type EFUSE_3_STATUS_3; /**< Offset: 0x78 (R/   32) EFUSE_3_3 Status */
  __IO EFUSE_MISC_REGS_EFUSE_4_PROG_0_Type EFUSE_4_PROG_0; /**< Offset: 0x7C (R/W  32) EFUSE_4_0 Program Register */
  __IO EFUSE_MISC_REGS_EFUSE_4_PROG_1_Type EFUSE_4_PROG_1; /**< Offset: 0x80 (R/W  32) EFUSE_4_1 Program Register */
  __IO EFUSE_MISC_REGS_EFUSE_4_PROG_2_Type EFUSE_4_PROG_2; /**< Offset: 0x84 (R/W  32) EFUSE_4_2 Program Register */
  __IO EFUSE_MISC_REGS_EFUSE_4_PROG_3_Type EFUSE_4_PROG_3; /**< Offset: 0x88 (R/W  32) EFUSE_4_3 Program Register */
  __I  EFUSE_MISC_REGS_EFUSE_4_STATUS_0_Type EFUSE_4_STATUS_0; /**< Offset: 0x8C (R/   32) EFUSE_4_0 Status */
  __I  EFUSE_MISC_REGS_EFUSE_4_STATUS_1_Type EFUSE_4_STATUS_1; /**< Offset: 0x90 (R/   32) EFUSE_4_1 Status */
  __I  EFUSE_MISC_REGS_EFUSE_4_STATUS_2_Type EFUSE_4_STATUS_2; /**< Offset: 0x94 (R/   32) EFUSE_4_2 Status */
  __I  EFUSE_MISC_REGS_EFUSE_4_STATUS_3_Type EFUSE_4_STATUS_3; /**< Offset: 0x98 (R/   32) EFUSE_4_3 Status */
  __IO EFUSE_MISC_REGS_EFUSE_5_PROG_0_Type EFUSE_5_PROG_0; /**< Offset: 0x9C (R/W  32) EFUSE_4_0 Program Register */
  __IO EFUSE_MISC_REGS_EFUSE_5_PROG_1_Type EFUSE_5_PROG_1; /**< Offset: 0xA0 (R/W  32) EFUSE_5_1 Program Register */
  __IO EFUSE_MISC_REGS_EFUSE_5_PROG_2_Type EFUSE_5_PROG_2; /**< Offset: 0xA4 (R/W  32) EFUSE_5_2 Program Register */
  __IO EFUSE_MISC_REGS_EFUSE_5_PROG_3_Type EFUSE_5_PROG_3; /**< Offset: 0xA8 (R/W  32) EFUSE_5_3 Program Register */
  __I  EFUSE_MISC_REGS_EFUSE_5_STATUS_0_Type EFUSE_5_STATUS_0; /**< Offset: 0xAC (R/   32) EFUSE_5_0 Status */
  __I  EFUSE_MISC_REGS_EFUSE_5_STATUS_1_Type EFUSE_5_STATUS_1; /**< Offset: 0xB0 (R/   32) EFUSE_5_1 Status */
  __I  EFUSE_MISC_REGS_EFUSE_5_STATUS_2_Type EFUSE_5_STATUS_2; /**< Offset: 0xB4 (R/   32) EFUSE_5_2 Status */
  __I  EFUSE_MISC_REGS_EFUSE_5_STATUS_3_Type EFUSE_5_STATUS_3; /**< Offset: 0xB8 (R/   32) EFUSE_5_3 Status */
  __IO EFUSE_MISC_REGS_EFUSE_6_PROG_0_Type EFUSE_6_PROG_0; /**< Offset: 0xBC (R/W  32) EFUSE_6_0 Program Register */
  __IO EFUSE_MISC_REGS_EFUSE_6_PROG_1_Type EFUSE_6_PROG_1; /**< Offset: 0xC0 (R/W  32) EFUSE_6_1 Program Register */
  __IO EFUSE_MISC_REGS_EFUSE_6_PROG_2_Type EFUSE_6_PROG_2; /**< Offset: 0xC4 (R/W  32) EFUSE_6_2 Program Register */
  __IO EFUSE_MISC_REGS_EFUSE_6_PROG_3_Type EFUSE_6_PROG_3; /**< Offset: 0xC8 (R/W  32) EFUSE_6_3 Program Register */
  __I  EFUSE_MISC_REGS_EFUSE_6_STATUS_0_Type EFUSE_6_STATUS_0; /**< Offset: 0xCC (R/   32) EFUSE_6_0 Status */
  __I  EFUSE_MISC_REGS_EFUSE_6_STATUS_1_Type EFUSE_6_STATUS_1; /**< Offset: 0xD0 (R/   32) EFUSE_6_1 Status */
  __I  EFUSE_MISC_REGS_EFUSE_6_STATUS_2_Type EFUSE_6_STATUS_2; /**< Offset: 0xD4 (R/   32) EFUSE_6_2 Status */
  __I  EFUSE_MISC_REGS_EFUSE_6_STATUS_3_Type EFUSE_6_STATUS_3; /**< Offset: 0xD8 (R/   32) EFUSE_6_3 Status */
  __I  EFUSE_MISC_REGS_EFUSE_MISC_CTRL_Type EFUSE_MISC_CTRL; /**< Offset: 0xDC (R/    8) EFUSE 6 Control Register */
} EfuseMiscRegs;

#else /* COMPONENT_TYPEDEF_STYLE */
#error Unknown component typedef style
#endif /* COMPONENT_TYPEDEF_STYLE */

#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

/** @}*/


#endif /* _SAMB11_EFUSE_MISC_REGS_COMPONENT_ */
